firstresponder/test/load.yml
config:
  target: "http://localhost:5173"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Warm up"
    - duration: 20
      arrivalRate: 10
      name: "Sustained load"
  plugins:
    # Ensure artillery plugin-metrics-by-endpoint is available if needed, but we'll use base metrics
scenarios:
  - name: "Homepage Load"
    flow:
      - get:
          url: "/"
      - get:
          url: "/assets/index.js" # Generic path, will fail gracefully if missing but simulates asset load